benchmarks/cospec_benchmark_results_20250515_013835_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_0_0_4_gsm8k_output.txt
INFO 05-15 07:24:31 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', dataset_name='gsm8k', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=20.0, logprobs=None, request_rate=4.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.0, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Loaded 7473 samples from cache
Temperature:  0.0
Checking server health at http://127.0.0.1:8001/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 20.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     4794      
Benchmark duration (s):                  1200.16   
Total input tokens:                      268651    
Total generated tokens:                  459453    
Request throughput (req/s):              3.99      
Output token throughput (tok/s):         382.83    
Total Token throughput (tok/s):          606.67    
---------------Time to First Token----------------
Mean TTFT (ms):                          46.41     
Median TTFT (ms):                        45.76     
P99 TTFT (ms):                           69.39     
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          25.72     
Median TPOT (ms):                        25.59     
P99 TPOT (ms):                           29.66     
---------------Inter-token Latency----------------
Mean ITL (ms):                           25.74     
Median ITL (ms):                         23.31     
P99 ITL (ms):                            50.65     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          2487.27   
Median E2EL (ms):                        2260.67   
P99 E2EL (ms):                           5801.40   
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 25.97     
Median Token Latency (ms):               25.84     
P99 Token Latency (ms):                  29.93     
==================================================