benchmarks/cospec_benchmark_results_20250515_013835_facebook/opt-6.7b_facebook/opt-125m_tp1_dtp1/baseline_1_0.5_4_sharegpt_output.txt
INFO 05-15 11:29:16 [__init__.py:239] Automatically detected platform cuda.
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8001, endpoint='/v1/completions', dataset_name='sharegpt', dataset_path=None, max_concurrency=None, model='facebook/opt-6.7b', tokenizer=None, use_beam_search=False, duration_minutes=20.0, logprobs=None, request_rate=4.0, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el,token_latency', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=0.5, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Temperature:  0.5
Checking server health at http://127.0.0.1:8001/health
Server is ready!
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: 4.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
Benchmark duration: 20.0 minutes
============ Serving Benchmark Result ============
Successful requests:                     4762      
Benchmark duration (s):                  1200.23   
Total input tokens:                      1083600   
Total generated tokens:                  1108608   
Request throughput (req/s):              3.97      
Output token throughput (tok/s):         923.67    
Total Token throughput (tok/s):          1826.49   
---------------Time to First Token----------------
Mean TTFT (ms):                          95.30     
Median TTFT (ms):                        84.92     
P99 TTFT (ms):                           235.39    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.48     
Median TPOT (ms):                        39.30     
P99 TPOT (ms):                           73.59     
---------------Inter-token Latency----------------
Mean ITL (ms):                           70.15     
Median ITL (ms):                         58.63     
P99 ITL (ms):                            244.34    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8932.81   
Median E2EL (ms):                        5801.97   
P99 E2EL (ms):                           42176.97  
-----Token Latency (e2e_latency / output_len)-----
Mean Token Latency (ms):                 42.35     
Median Token Latency (ms):               40.62     
P99 Token Latency (ms):                  81.85     
==================================================